sample/k8s/horizontal/k8s-hr-wrk-mixed-c6525-25g-exp14-havail0-hori0-verti1-infi1-t4-c512-d30-R500
No argument supplied nginx
using  args: threads=4 and connections=512 and duration=30 and requests=500
Running 30s test @ http://localhost:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 893.438ms, rate sampling interval: 7286ms
  Thread calibration: mean lat.: 960.598ms, rate sampling interval: 7995ms
  Thread calibration: mean lat.: 878.040ms, rate sampling interval: 7553ms
  Thread calibration: mean lat.: 768.935ms, rate sampling interval: 7467ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.25s     4.71s   18.91s    65.41%
    Req/Sec    77.88      3.44    86.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.64s 
 75.000%    9.21s 
 90.000%   12.75s 
 99.000%   18.91s 
 99.900%   22.17s 
 99.990%   23.18s 
 99.999%   24.58s 
100.000%   24.58s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.242     0.000000            1         1.00
       4.315     0.100000          622         1.11
    2082.815     0.200000         1244         1.25
    3377.151     0.300000         1865         1.43
    4485.119     0.400000         2489         1.67
    5640.191     0.500000         3108         2.00
    6303.743     0.550000         3421         2.22
    6930.431     0.600000         3733         2.50
    7614.463     0.650000         4041         2.86
    8359.935     0.700000         4352         3.33
    9207.807     0.750000         4662         4.00
    9740.287     0.775000         4824         4.44
   10199.039     0.800000         4974         5.00
   10797.055     0.825000         5129         5.71
   11321.343     0.850000         5284         6.67
   11993.087     0.875000         5439         8.00
   12369.919     0.887500         5518         8.89
   12746.751     0.900000         5596        10.00
   13172.735     0.912500         5673        11.43
   13746.175     0.925000         5750        13.33
   14434.303     0.937500         5828        16.00
   14770.175     0.943750         5867        17.78
   15171.583     0.950000         5906        20.00
   15556.607     0.956250         5945        22.86
   16015.359     0.962500         5983        26.67
   16367.615     0.968750         6022        32.00
   16711.679     0.971875         6042        35.56
   17022.975     0.975000         6061        40.00
   17301.503     0.978125         6081        45.71
   17596.415     0.981250         6100        53.33
   17973.247     0.984375         6119        64.00
   18153.471     0.985938         6130        71.11
   18317.311     0.987500         6139        80.00
   18628.607     0.989062         6149        91.43
   18956.287     0.990625         6159       106.67
   19398.655     0.992188         6168       128.00
   19628.031     0.992969         6173       142.22
   19759.103     0.993750         6178       160.00
   19972.095     0.994531         6183       182.86
   20119.551     0.995313         6187       213.33
   20381.695     0.996094         6192       256.00
   20627.455     0.996484         6195       284.44
   20742.143     0.996875         6197       320.00
   20840.447     0.997266         6200       365.71
   20889.599     0.997656         6202       426.67
   21151.743     0.998047         6204       512.00
   21381.119     0.998242         6206       568.89
   21463.039     0.998437         6207       640.00
   21807.103     0.998633         6208       731.43
   22151.167     0.998828         6209       853.33
   22167.551     0.999023         6211      1024.00
   22167.551     0.999121         6211      1137.78
   22364.159     0.999219         6212      1280.00
   22364.159     0.999316         6212      1462.86
   22544.383     0.999414         6213      1706.67
   22544.383     0.999512         6213      2048.00
   22790.143     0.999561         6214      2275.56
   22790.143     0.999609         6214      2560.00
   22790.143     0.999658         6214      2925.71
   23183.359     0.999707         6215      3413.33
   23183.359     0.999756         6215      4096.00
   23183.359     0.999780         6215      4551.11
   23183.359     0.999805         6215      5120.00
   23183.359     0.999829         6215      5851.43
   24575.999     0.999854         6216      6826.67
   24575.999     1.000000         6216          inf
#[Mean    =     6253.710, StdDeviation   =     4709.872]
#[Max     =    24559.616, Total count    =         6216]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9464 requests in 30.03s, 2.48MB read
  Socket errors: connect 0, read 0, write 1212, timeout 1019
Requests/sec:    315.13
Transfer/sec:     84.66KB