sample/k8s/horizontal/k8s-sn-wrk-mixed-c6525-25g-exp14-havail0-hori0-verti1-infi1-t4-c512-d30-R1500
No argument supplied nginx
using  args: threads=4 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://localhost:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 2.313ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.307ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.299ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.302ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.33ms  816.26us   4.94ms   74.78%
    Req/Sec   392.69    205.08     1.00k    70.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.10ms
 75.000%    2.71ms
 90.000%    3.45ms
 99.000%    4.94ms
 99.900%    6.39ms
 99.990%    8.13ms
 99.999%    8.76ms
100.000%    8.76ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.084     0.000000            1         1.00
       1.507     0.100000         2966         1.11
       1.634     0.200000         5933         1.25
       1.802     0.300000         8895         1.43
       1.962     0.400000        11870         1.67
       2.101     0.500000        14817         2.00
       2.193     0.550000        16314         2.22
       2.325     0.600000        17781         2.50
       2.477     0.650000        19257         2.86
       2.591     0.700000        20756         3.33
       2.715     0.750000        22219         4.00
       2.825     0.775000        22960         4.44
       2.935     0.800000        23701         5.00
       3.041     0.825000        24447         5.71
       3.141     0.850000        25187         6.67
       3.267     0.875000        25918         8.00
       3.355     0.887500        26291         8.89
       3.449     0.900000        26658        10.00
       3.549     0.912500        27029        11.43
       3.655     0.925000        27402        13.33
       3.767     0.937500        27768        16.00
       3.857     0.943750        27955        17.78
       3.955     0.950000        28140        20.00
       4.053     0.956250        28327        22.86
       4.151     0.962500        28513        26.67
       4.263     0.968750        28697        32.00
       4.343     0.971875        28791        35.56
       4.407     0.975000        28884        40.00
       4.491     0.978125        28975        45.71
       4.583     0.981250        29065        53.33
       4.695     0.984375        29159        64.00
       4.747     0.985938        29203        71.11
       4.811     0.987500        29249        80.00
       4.887     0.989062        29297        91.43
       4.991     0.990625        29342       106.67
       5.091     0.992188        29388       128.00
       5.143     0.992969        29411       142.22
       5.187     0.993750        29434       160.00
       5.287     0.994531        29459       182.86
       5.375     0.995313        29481       213.33
       5.547     0.996094        29504       256.00
       5.591     0.996484        29515       284.44
       5.667     0.996875        29527       320.00
       5.715     0.997266        29539       365.71
       5.783     0.997656        29550       426.67
       5.959     0.998047        29563       512.00
       6.019     0.998242        29567       568.89
       6.123     0.998437        29573       640.00
       6.227     0.998633        29579       731.43
       6.339     0.998828        29585       853.33
       6.463     0.999023        29591      1024.00
       6.511     0.999121        29593      1137.78
       6.523     0.999219        29596      1280.00
       6.627     0.999316        29599      1462.86
       6.695     0.999414        29602      1706.67
       6.911     0.999512        29605      2048.00
       6.919     0.999561        29606      2275.56
       7.203     0.999609        29608      2560.00
       7.295     0.999658        29609      2925.71
       7.351     0.999707        29611      3413.33
       7.891     0.999756        29612      4096.00
       7.947     0.999780        29613      4551.11
       7.999     0.999805        29614      5120.00
       7.999     0.999829        29614      5851.43
       8.115     0.999854        29615      6826.67
       8.127     0.999878        29616      8192.00
       8.127     0.999890        29616      9102.22
       8.187     0.999902        29617     10240.00
       8.187     0.999915        29617     11702.86
       8.187     0.999927        29617     13653.33
       8.623     0.999939        29618     16384.00
       8.623     0.999945        29618     18204.44
       8.623     0.999951        29618     20480.00
       8.623     0.999957        29618     23405.71
       8.623     0.999963        29618     27306.67
       8.759     0.999969        29619     32768.00
       8.759     1.000000        29619          inf
#[Mean    =        2.331, StdDeviation   =        0.816]
#[Max     =        8.752, Total count    =        29619]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44333 requests in 30.01s, 8.51MB read
  Socket errors: connect 0, read 0, write 0, timeout 23
  Non-2xx or 3xx responses: 32
Requests/sec:   1477.51
Transfer/sec:    290.27KB